snlkuharlocal/src/Documents/ЗаданиеНаМаркировку/ЗаданиеНаМаркировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаМаркировку</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фУпрощенныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьПалеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлочков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВБлочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукНаПалете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Штука</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Блочок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Коробка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодПалеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистМаркировки</name>
      <type>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаБронированияКМ</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистМаркировки</types>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ИспользованныеКодыАгрегаций/ИспользованныеКодыАгрегаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованныеКодыАгрегаций</name>
  <comment>Использованные коды агрегаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНаМаркировку/ManagerModule.bsl
#Область СозданиеДокументов


Функция Создать_ЗаданиеНаМаркировку(ДокОснование_ссылка) Экспорт
	
	//Кухарь 13.01.2025 начало	
	// Кухарь А.Ю.  14.01.2025 начало
	//
	если ТипЗнч(ДокОснование_ссылка)=Тип("ДокументСсылка.РасходнаяНакладная") тогда
		ИспользоватьПереопределениеДатМаркировки=Истина;
	иначе
		ИспользоватьПереопределениеДатМаркировки=ложь;
	КонецЕсли;
	// Кухарь А.Ю.  14.01.2025 конец
	
	
	Запрос=новый запрос;
	запрос.Текст=  "ВЫБРАТЬ
	|	ЗаданиеНаМаркировку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
	|ГДЕ
	|	ЗаданиеНаМаркировку.ДокОснование = &ДокОснование_ссылка" ;
	запрос.УстановитьПараметр("ДокОснование_ссылка",ДокОснование_ссылка);
	Выборка=запрос.Выполнить().Выбрать();
	ЗНМОбъект=Неопределено;
	пока Выборка.Следующий() цикл
		ЗНМОбъект=выборка.ссылка.получитьобъект();
		ЗНМОбъект.ПометкаУдаления=Ложь;
		ЗНМОбъект.Товары.Очистить();
		
	КонецЦикла;
	если ЗНМОбъект=Неопределено тогда
		ЗНМОбъект=Документы.ЗаданиеНаМаркировку.СоздатьДокумент();
		
		//Чирков+++ 26.02.2025
		ЗаполнитьШапкуДокумента(ЗНМОбъект, ПараметрыСеанса.Пользователь);
		//Чирков--- 26.02.2025
	КонецЕсли;
	
	
	ЗНМОбъект.Автор=ПараметрыСеанса.Пользователь;
	
	если ИспользоватьПереопределениеДатМаркировки тогда
		если ПолучитьРеквизитШапки(ДокОснование_ссылка,"ОтгрузкаКомплектов","Документ") тогда
			ИмяТЧ="Комплектующие";
		иначе
			ИмяТЧ="Товары";  
		КонецЕсли;
	иначе
		ИмяТЧ="Товары";  
	КонецЕсли;
	
	
	//Кухарь 05.09.2024 начало	
	если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад тогда
		Запрос.Текст="ВЫБРАТЬ
		|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаданиеНабораТовары.Количество) КАК Количество,
		|	ЗаданиеНабораТовары.Номенклатура.ОсновнаяЕдиница КАК Единица,
		|	ЗаданиеНабораТовары.Номенклатура.Коэффициент КАК Коэффициент
		|ИЗ
		|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
		|ГДЕ
		|	ЗаданиеНабораТовары.Ссылка.ТребуетсяМаркировка
		|	И ЗаданиеНабораТовары.Ссылка.Накладная = &ДокОснование_ссылка
		|	И ЗаданиеНабораТовары.Ссылка.Проведен
		|	И ЗаданиеНабораТовары.Ссылка.Дата >= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданиеНабораТовары.Номенклатура";
		запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
	иначе  
		//крохин начало 03.07.2025
		//HELP-5849
	    ВидДокумента	= ДокОснование_ссылка.Метаданные().Имя;
		//крохин конец 03.07.2025
		Запрос.Текст="ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество,
		|	РасходнаяНакладнаяТовары.Единица КАК Единица,
		|	РасходнаяНакладнаяТовары.Коэффициент КАК Коэффициент
		|ИЗ
		//крохин начало 03.07.2025
		//HELP-5849
	//	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары 
	    |	Документ."+ВидДокумента+".Товары КАК РасходнаяНакладнаяТовары 
		//крохин конец 03.07.2025
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		|	И РасходнаяНакладнаяТовары.Количество > 0
		|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> &ПустаяДата";    
		// Кухарь А.Ю.  07.07.2025 начало
		//|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой < РасходнаяНакладнаяТовары.Ссылка.ДатаОтгрузки";
		// Кухарь А.Ю.  07.07.2025 конец
		
		запрос.УстановитьПараметр("Ссылка",ДокОснование_ссылка);
		запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
		
		// Кухарь А.Ю.  19.01.2025 начало
		если ИмяТЧ = "Комплектующие" тогда
			запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.РасходнаяНакладная.Товары","Документ.РасходнаяНакладная.Комплектующие");
		КонецЕсли;
		// Кухарь А.Ю.  19.01.2025 конец


	КонецЕсли;
	//Кухарь 05.09.20204 начало	

	
	
	//Кухарь 13.01.2025 начало	
	//Даты из контрагентов и матриц
	если ИспользоватьПереопределениеДатМаркировки тогда
		ТаблицаПереопределяемыхДат=МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(ДокОснование_ссылка,ИмяТЧ);
	иначе
		ТаблицаПереопределяемыхДат=Неопределено;
	КонецЕсли;
	
	если ТаблицаПереопределяемыхДат<>Неопределено и ТаблицаПереопределяемыхДат.количество()> 0 тогда
		ТЗИсходная=запрос.Выполнить().Выгрузить();
		Запрос.Текст="ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество,
		|	ТЧ.Единица КАК Единица,
		|	ТЧ.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,
		|	ТЧ.Коэффициент КАК Коэффициент
		|ПОМЕСТИТЬ ВремТЗИсходная
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|	И ТЧ.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗПереопределяемая.Номенклатура КАК Номенклатура,
		|	ТЗПереопределяемая.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ВремТЗПереопределяемая
		|ИЗ
		|	&ТаблицаПереопределяемыхДат КАК ТЗПереопределяемая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремТЗПереопределяемая.Номенклатура КАК Номенклатура,
		|	ВремТЗПереопределяемая.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,
		|	ВремТЗИсходная.Количество КАК Количество,
		|	ВремТЗИсходная.Единица КАК Единица,
		|	ВремТЗИсходная.Коэффициент КАК Коэффициент
		|ИЗ
		|	ВремТЗПереопределяемая КАК ВремТЗПереопределяемая
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТЗИсходная КАК ВремТЗИсходная
		|		ПО ВремТЗПереопределяемая.Номенклатура = ВремТЗИсходная.Номенклатура
		|ГДЕ
		|	ВремТЗПереопределяемая.ДатаНачалаРаботыСМаркировкой <= &ДатаНачалаРаботыСМаркировкой";
		запрос.УстановитьПараметр("Ссылка",ДокОснование_ссылка);
		запрос.УстановитьПараметр("ДатаНачалаРаботыСМаркировкой",ПолучитьРеквизитШапки(ДокОснование_ссылка,"ДатаОтгрузки","Документ"));		
		запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат);
		
		// Кухарь А.Ю.  19.01.2025 начало
		если ИмяТЧ = "Комплектующие" тогда
			запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.РасходнаяНакладная.Товары","Документ.РасходнаяНакладная.Комплектующие");
		КонецЕсли;
		// Кухарь А.Ю.  19.01.2025 конец
		
	КонецЕсли;
	//Кухарь 13.01.2025 конец			
	ЗНМОбъект.Товары.Загрузить(запрос.Выполнить().Выгрузить());
	ЗНМОбъект.Дата=ТекущаяДатаСеанса();
	ЗНМОбъект.ДокОснование=ДокОснование_ссылка;
	ЗНМОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ЗНМОбъект.Ссылка;
	
	
КонецФункции //Создать_ЗаданиеНаМаркировку(ЗаданиеНабора_Ссылка) Экспорт

Функция Создать_Агрегации(ЗаданиеНаМаркировку_Ссылка, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	рШапки = ПолучитьРеквизитыШапки(ЗаданиеНаМаркировку_Ссылка, "фУпрощенныйРежим,фАгрегироватьБлочки,фАгрегироватьПалеты,фАгрегироватьКоробки"); 
	
	Если рШапки.фУпрощенныйРежим И рШапки.фАгрегироватьБлочки Тогда
		ДанныеЗаполнения = рШапки;
		ДанныеЗаполнения.Вставить("ДокументОснование",	ЗаданиеНаМаркировку_Ссылка);		
		ДанныеЗаполнения.Вставить("ТипШК",				Перечисления.ТипыШтрихКодов.Блочок);
		
		рСоздания = НайтиСоздатьДокАгрегации(ЗаданиеНаМаркировку_Ссылка, ДанныеЗаполнения.ТипШК);
		Если рСоздания.Успешно Тогда
			ДокОбъект = рСоздания.Данные;	
			
			ДокОбъект.Заполнить(ДанныеЗаполнения);
			
			ДокОбъект.Статус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыДокументовМаркировки.ВРаботе);
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
			
			Результат.Данные = ДокОбъект.Ссылка;
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;		
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рСоздания);	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ рШапки.фУпрощенныйРежим ИЛИ рШапки.фАгрегироватьКоробки Тогда
		рСоздания = НайтиСоздатьДокАгрегации(ЗаданиеНаМаркировку_Ссылка, Перечисления.ТипыШтрихКодов.Коробка);
		Если рСоздания.Успешно Тогда
			ДанныеЗаполнения = рШапки;
			ДанныеЗаполнения.Вставить("ДокументОснование",	ЗаданиеНаМаркировку_Ссылка);		
			ДанныеЗаполнения.Вставить("ТипШК",				Перечисления.ТипыШтрихКодов.Коробка);
			
			ДокОбъект = рСоздания.Данные;	
			
			ДокОбъект.Заполнить(ДанныеЗаполнения);
			
			ДокОбъект.Статус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыДокументовМаркировки.ВРаботе);
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
			
			Результат.Данные = ДокОбъект.Ссылка;
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;		
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рСоздания);	
		КонецЕсли;	
	КонецЕсли;	
	
	Если рШапки.фУпрощенныйРежим И рШапки.фАгрегироватьПалеты Тогда
		ДанныеЗаполнения = рШапки;
		ДанныеЗаполнения.Вставить("ДокументОснование", 	ЗаданиеНаМаркировку_Ссылка);		
		ДанныеЗаполнения.Вставить("ТипШК",				Перечисления.ТипыШтрихКодов.Палета);
		
		рСоздания = НайтиСоздатьДокАгрегации(ЗаданиеНаМаркировку_Ссылка, ДанныеЗаполнения.ТипШК);
		Если рСоздания.Успешно Тогда
			ДокОбъект = рСоздания.Данные;	
			
			ДокОбъект.Заполнить(ДанныеЗаполнения);
			
			ДокОбъект.Статус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыДокументовМаркировки.ВРаботе);
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
			
			Результат.Данные = ДокОбъект.Ссылка;
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;		
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рСоздания);	
		КонецЕсли;
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //Создать_Агрегации(ЗаданиеНаМаркировку_Ссылка) Экспорт

Функция НайтиСоздатьДокАгрегации(ДокументОснование, Знач ТипШК = Неопределено)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ТипШК = Неопределено Тогда
		ТипШК = Перечисления.ТипыШтрихКодов.Коробка;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|   Ссылка,
	|   Статус	
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП
	|ГДЕ
	|	ДокументОснование = &ДокументОснование	
	|	И ТипШК = &ТипШК
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("ДокументОснование",	ДокументОснование);
	Запрос.УстановитьПараметр("ТипШК", 				ТипШК);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Если Выборка.Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
			ТекстОшибки = СтрШаблон("Недопустимый статус существующего документа маркировки ! %1, статус: %2 !", Выборка.Ссылка, Выборка.Статус);
					
			Результат.Успешно = Ложь;
			Результат.Ошибки.Добавить(ТекстОшибки);
		Иначе
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();		
		
		ДокОбъект.ДокументОснование = ДокументОснование;
		ДокОбъект.ТипШК				= ТипШК;
	КонецЕсли;
	
	Результат.Данные = ДокОбъект;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьДокАгрегации(ДокументОснование)


// Кухарь А.Ю.  19.01.2025 начало
//
Функция НайтиСоздатьДокументДляМаркировкиПодОтгрузку (Накладная) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЗаданиеНаМаркировку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
	|ГДЕ
	|	ЗаданиеНаМаркировку.ДокОснование = &ДокОснование
	//       |	И ЗаданиеНаМаркировку.Проведен
	|	И не ЗаданиеНаМаркировку.ПометкаУдаления";
	запрос.УстановитьПараметр("ДокОснование",Накладная);
	Выборка=запрос.Выполнить().Выбрать();
	если Выборка.Количество()=0 тогда
		док=Документы.ЗаданиеНаМаркировку.Создать_ЗаданиеНаМаркировку(Накладная);
		Возврат док;
	КонецЕсли;
	
	пока Выборка.Следующий() цикл
		возврат Выборка.ссылка;
	КонецЦикла;
	
	
КонецФункции
 
Функция ДобавитьКодыАгрегаций(ДокСсылка, Коды, ДокументОснование = Неопределено) Экспорт
	Если ТипЗнч(Коды) = Тип("Массив") Тогда
		МассивКодов =  Коды;
	Иначе
		МассивКодов = Новый Массив;
		МассивКодов.Добавить(Коды);	
	КонецЕсли; 
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	Если 1=2 Тогда
		ДокОбъект = Документы.ЗаданиеНаМаркировку.СоздатьДокумент();	
	КонецЕсли;
	
	Для Каждого ШтрихКодКоробки Из МассивКодов Цикл
		Если ТипЗнч(ШтрихКодКоробки) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") И ЗначениеЗаполнено(ШтрихКодКоробки) Тогда
			Если ДокОбъект.ШтрихкодыКоробок.Найти(ШтрихКодКоробки, "ШтрихкодКоробки") = Неопределено Тогда
				СтрокаТЧ = ДокОбъект.ШтрихкодыКоробок.Добавить();
				
				СтрокаТЧ.ШтрихкодКоробки	= ШтрихкодКоробки;
				СтрокаТЧ.ДокументОснование 	= ДокументОснование;
			КонецЕсли; 
		КонецЕсли;	
	КонецЦикла;
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецФункции //ДобавитьКодыАгрегаций()
 

#КонецОбласти

Процедура ЗарегистрироватьИспользованныеКоробки(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	ШтрихкодКоробки КАК ШтрихКодУпаковки
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыКоробок
	|ГДЕ
	|	Ссылка = &Ссылка	
	|	И ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодКоробки.Наименование
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НЗ = РегистрыСведений.ИспользованныеКодыАгрегаций.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = НЗ.Добавить();
		Запись.ШтрихКодУпаковки = Выборка.ШтрихКодУпаковки;		
	КонецЦикла;
	
	Попытка
		//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		
		НЗ.Записать();
		
		//ЗафиксироватьТранзакцию();
	Исключение
		ВызватьИсключение "Не удалось забронировать агрегационные коды ! " + ОписаниеОшибки(); 
	КонецПопытки;
	
КонецПроцедуры

// Шворобей ВЮ 02.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
#Область ПроверкаНоменклатуры

Функция КонтрольНоменклатурыПоЗНМ(ДокОснование, ТекущаяНоменклатура = Неопределено, КоличествоДокумента = 0) Экспорт
	
	СтруктураВозврата = Новый Структура("ТЗ_ДругиеЗНМ, ТЗ_Сводная, ТЗ_Разница", Неопределено, Неопределено, Неопределено); 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяНоменклатура) Тогда Возврат СтруктураВозврата; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат СтруктураВозврата; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяНоменклатура", ТекущаяНоменклатура);
	Запрос.УстановитьПараметр("КоличествоДокумента", КоличествоДокумента);
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ТекущаяНоменклатура КАК Номенклатура,
	|	&КоличествоДокумента КАК КоличествоЗНМ,
	|	&ДокОснование КАК ДокОснование
	|ПОМЕСТИТЬ вр_ТоварыИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыРНК.Ссылка КАК РНК,
	|	ТоварыРНК.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыРНК.Количество, 0) КАК КоличествоРНК
	|ПОМЕСТИТЬ вр_ТоварыРНК
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК ТоварыРНК
	|ГДЕ
	|	ТоварыРНК.Ссылка = &ДокОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РНК,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНМ_ШКУпаковок.Ссылка КАК ДругиеЗНМ,
	|	СпрКМ.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(ЗНМ_ШКУпаковок.ШтрихкодУпаковки) КАК КоличествоВДругихЗНМ
	|ПОМЕСТИТЬ вр_ДругиеЗНМ
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗНМ_ШКУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗНМ
	|		ПО (ЗНМ.Ссылка = ЗНМ_ШКУпаковок.Ссылка)
	|			И (ЗНМ.Проведен)
	|			И (ЗНМ.ДокОснование = &ДокОснование)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрКМ
	|		ПО (СпрКМ.Ссылка = ЗНМ_ШКУпаковок.ШтрихкодУпаковки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО (ЗНМ.ДокОснование = вр_ТоварыРНК.РНК)
	|			И (СпрКМ.Владелец = вр_ТоварыРНК.Номенклатура)   
	// Кухарь А.Ю.  13.10.2025 начало 
	//HELP-6865
	|ГДЕ
	|	ЗНМ_ШКУпаковок.Ссылка.ДокОснование = &ДокОснование 
	// Кухарь А.Ю.  13.10.2025 конец
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗНМ_ШКУпаковок.Ссылка,
	|	СпрКМ.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ДругиеЗНМ.Номенклатура КАК Номенклатура,
	|	СУММА(вр_ДругиеЗНМ.КоличествоВДругихЗНМ) КАК КоличествоВДругихЗНМ
	|ПОМЕСТИТЬ тзвр_ДругиеЗНМ
	|ИЗ
	|	вр_ДругиеЗНМ КАК вр_ДругиеЗНМ
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ДругиеЗНМ.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрКМ.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОМ_ШтрихкодыУпаковок.ШтрихкодУпаковки) КАК КоличествоОМ
	|ПОМЕСТИТЬ вр_ШК_ОМ_РНК
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ОМ_ШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК ОМ
	|		ПО (ОМ.Ссылка = ОМ_ШтрихкодыУпаковок.Ссылка)
	|			И (ОМ.Проведен)
	|			И (ОМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрКМ
	|		ПО (СпрКМ.Ссылка = ОМ_ШтрихкодыУпаковок.ШтрихкодУпаковки)
	|			И (СпрКМ.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО (ОМ.ДокументОснование = вр_ТоварыРНК.РНК)
	|			И (СпрКМ.Владелец = вр_ТоварыРНК.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрКМ.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрШК_Коробки.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СпрШК_ВложенныеШтрихкоды.Штрихкод) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вр_ШтрихКодыКоробок
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ОМ_ШтрихкодыКоробок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК ОМ
	|		ПО ОМ_ШтрихкодыКоробок.Ссылка = ОМ.Ссылка
	|			И (ОМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация))
	|			И (ОМ.ТипШК В (ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка), ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК_Коробки
	|		ПО ОМ_ШтрихкодыКоробок.ШтрихкодКоробки = СпрШК_Коробки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК СпрШК_ВложенныеШтрихкоды
	|		ПО ОМ_ШтрихкодыКоробок.ШтрихкодКоробки = СпрШК_ВложенныеШтрихкоды.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО (ОМ.ДокументОснование = вр_ТоварыРНК.РНК)
	|			И (СпрШК_Коробки.Владелец = вр_ТоварыРНК.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ОМ_ШтрихкодыУпаковок
	|		ПО (ОМ_ШтрихкодыУпаковок.Ссылка = ОМ.Ссылка)
	|			И (ОМ_ШтрихкодыУпаковок.ШтрихкодКоробки = ОМ_ШтрихкодыКоробок.ШтрихкодКоробки)
	|ГДЕ
	|	ОМ_ШтрихкодыУпаковок.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрШК_Коробки.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ТоварыИсточник.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(вр_ТоварыРНК.КоличествоРНК, 0) КАК КоличествоРНК,
	|	ЕСТЬNULL(вр_ТоварыИсточник.КоличествоЗНМ, 0) КАК КоличествоЗНМ,
	|	ЕСТЬNULL(тзвр_ДругиеЗНМ.КоличествоВДругихЗНМ, 0) КАК КоличествоВДругихЗНМ,
	|	ЕСТЬNULL(вр_ШК_ОМ_РНК.КоличествоОМ, 0) КАК КоличествоОМ,
	|	ЕСТЬNULL(вр_ШтрихКодыКоробок.КоличествоУпаковок, 0) КАК КоличествоУпаковокОМ,
	|	ЕСТЬNULL(вр_ТоварыРНК.КоличествоРНК, 0) - ЕСТЬNULL(вр_ТоварыИсточник.КоличествоЗНМ, 0) - ЕСТЬNULL(тзвр_ДругиеЗНМ.КоличествоВДругихЗНМ, 0) - ЕСТЬNULL(вр_ШК_ОМ_РНК.КоличествоОМ, 0) - ЕСТЬNULL(вр_ШтрихКодыКоробок.КоличествоУпаковок, 0) КАК Разница
	|ПОМЕСТИТЬ вр_Итоги
	|ИЗ
	|	вр_ТоварыИсточник КАК вр_ТоварыИсточник
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО вр_ТоварыИсточник.Номенклатура = вр_ТоварыРНК.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ тзвр_ДругиеЗНМ КАК тзвр_ДругиеЗНМ
	|		ПО вр_ТоварыИсточник.Номенклатура = тзвр_ДругиеЗНМ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ШК_ОМ_РНК КАК вр_ШК_ОМ_РНК
	|		ПО вр_ТоварыИсточник.Номенклатура = вр_ШК_ОМ_РНК.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ШтрихКодыКоробок КАК вр_ШтрихКодыКоробок
	|		ПО вр_ТоварыИсточник.Номенклатура = вр_ШтрихКодыКоробок.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Итоги.Номенклатура КАК Номенклатура,
	|	СУММА(вр_Итоги.КоличествоРНК) КАК КоличествоРНК,
	|	СУММА(вр_Итоги.КоличествоЗНМ) КАК КоличествоЗНМ,
	|	СУММА(вр_Итоги.КоличествоВДругихЗНМ) КАК КоличествоВДругихЗНМ,
	|	СУММА(вр_Итоги.КоличествоОМ) КАК КоличествоОМ,
	|	СУММА(вр_Итоги.КоличествоУпаковокОМ) КАК КоличествоУпаковокОМ
	|ИЗ
	|	вр_Итоги КАК вр_Итоги
	|ГДЕ
	|	вр_Итоги.Разница < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Итоги.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТЗ_ДругиеЗНМ = МассивПакета[2].Выгрузить();
	ТЗ_Сводная = МассивПакета[6].Выгрузить();
	ТЗ_Разница = МассивПакета[7].Выгрузить();
	
	СтруктураВозврата.Вставить("ТЗ_ДругиеЗНМ", ТЗ_ДругиеЗНМ);
	СтруктураВозврата.Вставить("ТЗ_Сводная", ТЗ_Сводная);
	СтруктураВозврата.Вставить("ТЗ_Разница", ТЗ_Разница);

	Возврат СтруктураВозврата;
	
КонецФункции

Функция КонтрольНоменклатурыПоЗНМ_ПоСсылке(ДокСсылка, ТекущаяНоменклатура = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("ТЗ_ДругиеЗНМ, ТЗ_Сводная, ТЗ_Разница", Неопределено, Неопределено, Неопределено); 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяНоменклатура) Тогда Возврат СтруктураВозврата; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда Возврат СтруктураВозврата; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяНоменклатура", ТекущаяНоменклатура);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);    
	// Кухарь А.Ю.  13.10.2025 начало
	Запрос.УстановитьПараметр("ДокОснование", ПолучитьРеквизитШапки(ДокСсылка,"ДокОснование","Документ"));   	
	// Кухарь А.Ю.  13.10.2025 конец
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШКУпаковокЗНМ.Ссылка КАК ЗНМ,
	|	ШКУпаковокЗНМ.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(ШКУпаковокЗНМ.ШтрихкодУпаковки) КАК КоличествоЗНМ
	|ПОМЕСТИТЬ вр_ТоварыИсточник
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ШКУпаковокЗНМ
	|ГДЕ
	|	ШКУпаковокЗНМ.Ссылка = &ДокСсылка
	|	И ТИПЗНАЧЕНИЯ(ШКУпаковокЗНМ.Ссылка.ДокОснование) = ТИП(Документ.РасходнаяНакладная)
	|	И ШКУпаковокЗНМ.Ссылка.ДокОснование.Проведен
	|	И ШКУпаковокЗНМ.ШтрихкодУпаковки.Владелец = &ТекущаяНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ШКУпаковокЗНМ.Ссылка,
	|	ШКУпаковокЗНМ.ШтрихкодУпаковки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыРНК.Ссылка КАК РНК,
	|	ТоварыРНК.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыРНК.Количество, 0) КАК КоличествоРНК
	|ПОМЕСТИТЬ вр_ТоварыРНК
	|ИЗ
	|	вр_ТоварыИсточник КАК вр_ТоварыИсточник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК ТоварыРНК
	|		ПО вр_ТоварыИсточник.ЗНМ.ДокОснование = ТоварыРНК.Ссылка
	|			И вр_ТоварыИсточник.Номенклатура = ТоварыРНК.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШКУпаковокЗНМ.Ссылка КАК ДругиеЗНМ,
	|	ШКУпаковокЗНМ.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(ШКУпаковокЗНМ.ШтрихкодУпаковки) КАК КоличествоВДругихЗНМ
	|ПОМЕСТИТЬ вр_ДругиеЗНМ
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ШКУпаковокЗНМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО ШКУпаковокЗНМ.Ссылка.ДокОснование = вр_ТоварыРНК.РНК
	|			И ШКУпаковокЗНМ.ШтрихкодУпаковки.Владелец = вр_ТоварыРНК.Номенклатура
	|ГДЕ
	|	ШКУпаковокЗНМ.Ссылка <> &ДокСсылка
	 
	// Кухарь А.Ю.  13.10.2025 начало  
	//HELP-6865
	// по мне не нужно условие на проведение ДОКОСНОВАНИЯ. Либо нужно но не тут, а в момент создания ЗНМ.
	// |	И ШКУпаковокЗНМ.Ссылка.ДокОснование.Проведен 
	|	И ШКУпаковокЗНМ.Ссылка.ДокОснование = &ДокОснование
	// Кухарь А.Ю.  13.10.2025 конец
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ШКУпаковокЗНМ.Ссылка,
	|	ШКУпаковокЗНМ.ШтрихкодУпаковки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ДругиеЗНМ.Номенклатура КАК Номенклатура,
	|	СУММА(вр_ДругиеЗНМ.КоличествоВДругихЗНМ) КАК КоличествоВДругихЗНМ
	|ПОМЕСТИТЬ тзвр_ДругиеЗНМ
	|ИЗ
	|	вр_ДругиеЗНМ КАК вр_ДругиеЗНМ
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ДругиеЗНМ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокОМ.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокОМ.ШтрихкодУпаковки) КАК КоличествоОМ
	|ПОМЕСТИТЬ вр_ШК_ОМ_РНК
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ШтрихкодыУпаковокОМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО ШтрихкодыУпаковокОМ.Ссылка.ДокументОснование = вр_ТоварыРНК.РНК
	|			И ШтрихкодыУпаковокОМ.ШтрихкодУпаковки.Владелец = вр_ТоварыРНК.Номенклатура
	|ГДЕ
	|	ШтрихкодыУпаковокОМ.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И ШтрихкодыУпаковокОМ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И ШтрихкодыУпаковокОМ.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокОМ.ШтрихкодУпаковки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаркировкаТоваровИСМПШтрихкодыКоробок.ШтрихкодКоробки.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вр_ШтрихКодыКоробок
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК МаркировкаТоваровИСМПШтрихкодыКоробок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|		ПО МаркировкаТоваровИСМПШтрихкодыКоробок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|		ПО (МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка)
	|			И (МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыКоробок.ШтрихкодКоробки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО МаркировкаТоваровИСМПШтрихкодыКоробок.ШтрихкодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО МаркировкаТоваровИСМПШтрихкодыКоробок.Ссылка.ДокументОснование = вр_ТоварыРНК.РНК
	|			И МаркировкаТоваровИСМПШтрихкодыКоробок.ШтрихкодКоробки.Владелец = вр_ТоварыРНК.Номенклатура
	|ГДЕ
	|	МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И МаркировкаТоваровИСМП.ТипШК В (ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка), ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	МаркировкаТоваровИСМПШтрихкодыКоробок.ШтрихкодКоробки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ТоварыИсточник.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(вр_ТоварыРНК.КоличествоРНК, 0) КАК КоличествоРНК,
	|	ЕСТЬNULL(вр_ТоварыИсточник.КоличествоЗНМ, 0) КАК КоличествоЗНМ,
	|	ЕСТЬNULL(тзвр_ДругиеЗНМ.КоличествоВДругихЗНМ, 0) КАК КоличествоВДругихЗНМ,
	|	ЕСТЬNULL(вр_ШК_ОМ_РНК.КоличествоОМ, 0) КАК КоличествоОМ,
	|	ЕСТЬNULL(вр_ШтрихКодыКоробок.КоличествоУпаковок, 0) КАК КоличествоУпаковокОМ,
	|	ЕСТЬNULL(вр_ТоварыРНК.КоличествоРНК, 0) - ЕСТЬNULL(вр_ТоварыИсточник.КоличествоЗНМ, 0) - ЕСТЬNULL(тзвр_ДругиеЗНМ.КоличествоВДругихЗНМ, 0) - ЕСТЬNULL(вр_ШК_ОМ_РНК.КоличествоОМ, 0) - ЕСТЬNULL(вр_ШтрихКодыКоробок.КоличествоУпаковок, 0) КАК Разница
	|ПОМЕСТИТЬ вр_Итоги
	|ИЗ
	|	вр_ТоварыИсточник КАК вр_ТоварыИсточник
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ТоварыРНК КАК вр_ТоварыРНК
	|		ПО вр_ТоварыИсточник.Номенклатура = вр_ТоварыРНК.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ тзвр_ДругиеЗНМ КАК тзвр_ДругиеЗНМ
	|		ПО вр_ТоварыИсточник.Номенклатура = тзвр_ДругиеЗНМ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ШК_ОМ_РНК КАК вр_ШК_ОМ_РНК
	|		ПО вр_ТоварыИсточник.Номенклатура = вр_ШК_ОМ_РНК.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ШтрихКодыКоробок КАК вр_ШтрихКодыКоробок
	|		ПО вр_ТоварыИсточник.Номенклатура = вр_ШтрихКодыКоробок.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Итоги.Номенклатура КАК Номенклатура,
	|	СУММА(вр_Итоги.КоличествоРНК) КАК КоличествоРНК,
	|	СУММА(вр_Итоги.КоличествоЗНМ) КАК КоличествоЗНМ,
	|	СУММА(вр_Итоги.КоличествоВДругихЗНМ) КАК КоличествоВДругихЗНМ,
	|	СУММА(вр_Итоги.КоличествоОМ) КАК КоличествоОМ,
	|	СУММА(вр_Итоги.КоличествоУпаковокОМ) КАК КоличествоУпаковокОМ
	|ИЗ
	|	вр_Итоги КАК вр_Итоги
	|ГДЕ
	|	вр_Итоги.Разница < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Итоги.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТЗ_ДругиеЗНМ = МассивПакета[2].Выгрузить();
	ТЗ_Сводная = МассивПакета[6].Выгрузить();
	ТЗ_Разница = МассивПакета[7].Выгрузить();
	
	СтруктураВозврата.Вставить("ТЗ_ДругиеЗНМ", ТЗ_ДругиеЗНМ);
	СтруктураВозврата.Вставить("ТЗ_Сводная", ТЗ_Сводная);
	СтруктураВозврата.Вставить("ТЗ_Разница", ТЗ_Разница);

	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 02.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
